// Запрос целого числа и возведение в квадрат 
/*Console.WriteLine("Input number");
int num = Convert.ToInt32(Console.ReadLine());
//Console.WriteLine(a);
int quad = num * num;
Console.WriteLine($"Quad of {num} -> {quad}");*/

//Написать программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго

/*Console.WriteLine("Input number 1");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input number 2");
int num2 = Convert.ToInt32(Console.ReadLine());

int quad = num2 * num2;

if (quad == num1)
{
    Console.WriteLine($"{num1} is quad of {num2}");
}
else
